{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/huangguo/Desktop/613/session 2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}16 Apr 2019, 02:22:09
{txt}
{com}. 
. //HW1 
. //Exercise 1
. set obs 10000
{txt}{p}
number of observations (_N)  was 0,
now 10,000
{p_end}

{com}. set seed 100
{txt}
{com}. generate x1=runiform(0,1)
{txt}
{com}. generate x2=rgamma(3,2)
{txt}
{com}. generate x3=rbinomial(10000,0.3)
{txt}
{com}. generate eps=rnormal(2,1)
{txt}
{com}. generate Y=0.5+1.2*x1-0.9*x2+0.1*x3+eps
{txt}
{com}. egen mean_Y=mean(Y)
{txt}
{com}. generate ydum=0 
{txt}
{com}. replace ydum=1 if Y>mean_Y & Y!=0
{txt}(5,086 real changes made)

{com}. //Exercise 2
. //Question 1
. correlate Y x1
{txt}(obs=10,000)

             {c |}        Y       x1
{hline 13}{c +}{hline 18}
           Y {c |}{res}   1.0000
          {txt}x1 {c |}{res}   0.0552   1.0000

{txt}
{com}. // Conclusion: the correlation is 0.047, which is far different from 1.2
. //Question 2 and Question 3 (Calculate standard errors by using OLS formula)
. regress ydum x1 x2 x3

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    10,000
{txt}{hline 13}{c +}{hline 34}   F(3, 9996)      = {res}  5169.90
{txt}       Model {c |} {res} 1519.76925         3  506.589751   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 979.491146     9,996   .09798831   {txt}R-squared       ={res}    0.6081
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6080
{txt}       Total {c |} {res}  2499.2604     9,999  .249951035   {txt}Root MSE        =   {res} .31303

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2}  .082039{col 26}{space 2} .0107821{col 37}{space 1}    7.61{col 46}{space 3}0.000{col 54}{space 4} .0609039{col 67}{space 3} .1031741
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-.0600468{col 26}{space 2} .0009009{col 37}{space 1}  -66.65{col 46}{space 3}0.000{col 54}{space 4}-.0618128{col 67}{space 3}-.0582808
{txt}{space 10}x3 {c |}{col 14}{res}{space 2} .0071557{col 26}{space 2} .0000677{col 37}{space 1}  105.74{col 46}{space 3}0.000{col 54}{space 4} .0070231{col 67}{space 3} .0072884
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-20.63535{col 26}{space 2} .2030814{col 37}{space 1} -101.61{col 46}{space 3}0.000{col 54}{space 4}-21.03343{col 67}{space 3}-20.23727
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. // Question 3 (Calculate standrad errors by using bootstrap)
. bootstrap, reps(49) seed(100): regress ydum x1 x2 x3
{txt}(running regress on estimation sample)
{res}
{txt}Bootstrap replications ({res}49{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
.................................................
{res}
{txt}Linear regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}Replications{col 67}= {res}        49
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res}  11976.38
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.6081
{txt}{col 49}Adj R-squared{col 67}= {res}    0.6080
{txt}{col 49}Root MSE{col 67}= {res}    0.3130

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2}  .082039{col 26}{space 2} .0107211{col 37}{space 1}    7.65{col 46}{space 3}0.000{col 54}{space 4} .0610261{col 67}{space 3} .1030519
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-.0600468{col 26}{space 2} .0012123{col 37}{space 1}  -49.53{col 46}{space 3}0.000{col 54}{space 4}-.0624229{col 67}{space 3}-.0576707
{txt}{space 10}x3 {c |}{col 14}{res}{space 2} .0071557{col 26}{space 2} .0000713{col 37}{space 1}  100.42{col 46}{space 3}0.000{col 54}{space 4} .0070161{col 67}{space 3} .0072954
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-20.63535{col 26}{space 2} .2124371{col 37}{space 1}  -97.14{col 46}{space 3}0.000{col 54}{space 4}-21.05172{col 67}{space 3}-20.21898
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. bootstrap, reps(499) seed(100): regress ydum x1 x2 x3
{txt}(running regress on estimation sample)
{res}
{txt}Bootstrap replications ({res}499{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
.................................................
{res}
{txt}Linear regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}Replications{col 67}= {res}       499
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res}  16372.83
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.6081
{txt}{col 49}Adj R-squared{col 67}= {res}    0.6080
{txt}{col 49}Root MSE{col 67}= {res}    0.3130

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2}  .082039{col 26}{space 2} .0105258{col 37}{space 1}    7.79{col 46}{space 3}0.000{col 54}{space 4} .0614088{col 67}{space 3} .1026692
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-.0600468{col 26}{space 2} .0009732{col 37}{space 1}  -61.70{col 46}{space 3}0.000{col 54}{space 4}-.0619542{col 67}{space 3}-.0581394
{txt}{space 10}x3 {c |}{col 14}{res}{space 2} .0071557{col 26}{space 2} .0000649{col 37}{space 1}  110.27{col 46}{space 3}0.000{col 54}{space 4} .0070285{col 67}{space 3} .0072829
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-20.63535{col 26}{space 2} .1951443{col 37}{space 1} -105.74{col 46}{space 3}0.000{col 54}{space 4}-21.01782{col 67}{space 3}-20.25287
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //Exercise 3
. mlexp ( ydum*lnnormal({c -(}b1{c )-}*x1 + {c -(}b2{c )-}*x2 + {c -(}b3{c )-}*x3+{c -(}b0{c )-}) + (1-ydum)*lnnormal(-({c -(}b1{c )-}*x1 + {c -(}b2{c )-}*x2 + {c -(}b3{c )-}*x3+ {c -(}b0{c )-})) )
{res}
{txt}initial:{col 16}log likelihood = {res:-6931.4718}
alternative:{col 16}log likelihood = {res:-5.447e+09}
rescale:{col 16}log likelihood = {res:-6928.2339}
rescale eq:{col 16}log likelihood = {res:-6330.3001}
Iteration 0:{space 3}log likelihood = {res:-6330.3001}  
Iteration 1:{space 3}log likelihood = {res: -1522.617}  
Iteration 2:{space 3}log likelihood = {res:-1306.1919}  (not concave)
Iteration 3:{space 3}log likelihood = {res:-1306.0285}  
Iteration 4:{space 3}log likelihood = {res:-1303.0178}  
Iteration 5:{space 3}log likelihood = {res:-1300.9126}  
Iteration 6:{space 3}log likelihood = {res:-1300.9109}  
Iteration 7:{space 3}log likelihood = {res:-1300.9109}  

Maximum likelihood estimation

Log likelihood = {res}-1300.9109{txt}{col 49}Number of obs{col 67}= {res}    10,000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /b1 {c |}{col 14}{res}{space 2} 1.111121{col 26}{space 2} .1000673{col 37}{space 1}   11.10{col 46}{space 3}0.000{col 54}{space 4}  .914993{col 67}{space 3}  1.30725
{txt}         /b2 {c |}{col 14}{res}{space 2}-.9003965{col 26}{space 2} .0243935{col 37}{space 1}  -36.91{col 46}{space 3}0.000{col 54}{space 4}-.9482069{col 67}{space 3}-.8525861
{txt}         /b3 {c |}{col 14}{res}{space 2} .1015293{col 26}{space 2} .0026436{col 37}{space 1}   38.41{col 46}{space 3}0.000{col 54}{space 4}  .096348{col 67}{space 3} .1067106
{txt}         /b0 {c |}{col 14}{res}{space 2}-299.7352{col 26}{space 2} 7.811394{col 37}{space 1}  -38.37{col 46}{space 3}0.000{col 54}{space 4}-315.0453{col 67}{space 3}-284.4252
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ///Exercise 4
> regress ydum x1 x2 x3

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    10,000
{txt}{hline 13}{c +}{hline 34}   F(3, 9996)      = {res}  5169.90
{txt}       Model {c |} {res} 1519.76925         3  506.589751   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 979.491146     9,996   .09798831   {txt}R-squared       ={res}    0.6081
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6080
{txt}       Total {c |} {res}  2499.2604     9,999  .249951035   {txt}Root MSE        =   {res} .31303

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2}  .082039{col 26}{space 2} .0107821{col 37}{space 1}    7.61{col 46}{space 3}0.000{col 54}{space 4} .0609039{col 67}{space 3} .1031741
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-.0600468{col 26}{space 2} .0009009{col 37}{space 1}  -66.65{col 46}{space 3}0.000{col 54}{space 4}-.0618128{col 67}{space 3}-.0582808
{txt}{space 10}x3 {c |}{col 14}{res}{space 2} .0071557{col 26}{space 2} .0000677{col 37}{space 1}  105.74{col 46}{space 3}0.000{col 54}{space 4} .0070231{col 67}{space 3} .0072884
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-20.63535{col 26}{space 2} .2030814{col 37}{space 1} -101.61{col 46}{space 3}0.000{col 54}{space 4}-21.03343{col 67}{space 3}-20.23727
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //Interpretation: All the coefficients in the linear regression model are significant，
. mlogit ydum x1 x2 x3

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6929.9925}  
Iteration 1:{space 3}log likelihood = {res:-1366.0008}  
Iteration 2:{space 3}log likelihood = {res:-1305.7095}  
Iteration 3:{space 3}log likelihood = {res:-1305.2521}  
Iteration 4:{space 3}log likelihood = {res:-1305.2516}  
Iteration 5:{space 3}log likelihood = {res:-1305.2516}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}  11249.48
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1305.2516{txt}{col 49}Pseudo R2{col 67}= {res}    0.8117

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0            {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2}-2.013608{col 26}{space 2}  .182341{col 37}{space 1}  -11.04{col 46}{space 3}0.000{col 54}{space 4} -2.37099{col 67}{space 3}-1.656227
{txt}{space 10}x2 {c |}{col 14}{res}{space 2} 1.626859{col 26}{space 2} .0483657{col 37}{space 1}   33.64{col 46}{space 3}0.000{col 54}{space 4} 1.532064{col 67}{space 3} 1.721654
{txt}{space 10}x3 {c |}{col 14}{res}{space 2} -.183193{col 26}{space 2}  .005262{col 37}{space 1}  -34.81{col 46}{space 3}0.000{col 54}{space 4}-.1935063{col 67}{space 3}-.1728797
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 540.8132{col 26}{space 2} 15.54509{col 37}{space 1}   34.79{col 46}{space 3}0.000{col 54}{space 4} 510.3453{col 67}{space 3}  571.281
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 1716 observations completely determined.{txt}  Standard errors questionable.{p_end}

{com}. //Interpretation: All the coefficients in the linear regression model are significant，
. probit ydum x1 x2 x3

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6929.9925}  
Iteration 1:{space 3}log likelihood = {res:-1335.1355}  
Iteration 2:{space 3}log likelihood = {res:-1301.2137}  
Iteration 3:{space 3}log likelihood = {res:-1300.9111}  
Iteration 4:{space 3}log likelihood = {res:-1300.9109}  
Iteration 5:{space 3}log likelihood = {res:-1300.9109}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}  11258.16
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1300.9109{txt}{col 49}Pseudo R2{col 67}= {res}    0.8123

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2} 1.111121{col 26}{space 2}  .100071{col 37}{space 1}   11.10{col 46}{space 3}0.000{col 54}{space 4} .9149857{col 67}{space 3} 1.307257
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-.9003964{col 26}{space 2} .0244037{col 37}{space 1}  -36.90{col 46}{space 3}0.000{col 54}{space 4}-.9482268{col 67}{space 3} -.852566
{txt}{space 10}x3 {c |}{col 14}{res}{space 2} .1015293{col 26}{space 2} .0026449{col 37}{space 1}   38.39{col 46}{space 3}0.000{col 54}{space 4} .0963453{col 67}{space 3} .1067132
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-299.7352{col 26}{space 2} 7.815309{col 37}{space 1}  -38.35{col 46}{space 3}0.000{col 54}{space 4}-315.0529{col 67}{space 3}-284.4175
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 1430 failures and 1357 successes completely determined.{p_end}

{com}. //Interpretation: All the coefficients in the linear regression model are significant，
. //Comparision: The coefficients in the probit model and logit model are very close except their intercepts. The signs of the coefficients are respectively the same in all these three models. 
. //Exercise 5
. probit ydum x1 x2 x3

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6929.9925}  
Iteration 1:{space 3}log likelihood = {res:-1335.1355}  
Iteration 2:{space 3}log likelihood = {res:-1301.2137}  
Iteration 3:{space 3}log likelihood = {res:-1300.9111}  
Iteration 4:{space 3}log likelihood = {res:-1300.9109}  
Iteration 5:{space 3}log likelihood = {res:-1300.9109}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}  11258.16
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1300.9109{txt}{col 49}Pseudo R2{col 67}= {res}    0.8123

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2} 1.111121{col 26}{space 2}  .100071{col 37}{space 1}   11.10{col 46}{space 3}0.000{col 54}{space 4} .9149857{col 67}{space 3} 1.307257
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-.9003964{col 26}{space 2} .0244037{col 37}{space 1}  -36.90{col 46}{space 3}0.000{col 54}{space 4}-.9482268{col 67}{space 3} -.852566
{txt}{space 10}x3 {c |}{col 14}{res}{space 2} .1015293{col 26}{space 2} .0026449{col 37}{space 1}   38.39{col 46}{space 3}0.000{col 54}{space 4} .0963453{col 67}{space 3} .1067132
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-299.7352{col 26}{space 2} 7.815309{col 37}{space 1}  -38.35{col 46}{space 3}0.000{col 54}{space 4}-315.0529{col 67}{space 3}-284.4175
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 1430 failures and 1357 successes completely determined.{p_end}

{com}. margins, dydx(*) vce(delta)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    10,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(ydum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:x1 x2 x3}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2} .0802152{col 26}{space 2} .0069262{col 37}{space 1}   11.58{col 46}{space 3}0.000{col 54}{space 4} .0666401{col 67}{space 3} .0937904
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-.0650023{col 26}{space 2}  .000545{col 37}{space 1} -119.28{col 46}{space 3}0.000{col 54}{space 4}-.0660704{col 67}{space 3}-.0639342
{txt}{space 10}x3 {c |}{col 14}{res}{space 2} .0073297{col 26}{space 2}  .000024{col 37}{space 1}  305.18{col 46}{space 3}0.000{col 54}{space 4} .0072826{col 67}{space 3} .0073768
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mlogit ydum x1 x2 x3

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6929.9925}  
Iteration 1:{space 3}log likelihood = {res:-1366.0008}  
Iteration 2:{space 3}log likelihood = {res:-1305.7095}  
Iteration 3:{space 3}log likelihood = {res:-1305.2521}  
Iteration 4:{space 3}log likelihood = {res:-1305.2516}  
Iteration 5:{space 3}log likelihood = {res:-1305.2516}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}  11249.48
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1305.2516{txt}{col 49}Pseudo R2{col 67}= {res}    0.8117

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        ydum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0            {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2}-2.013608{col 26}{space 2}  .182341{col 37}{space 1}  -11.04{col 46}{space 3}0.000{col 54}{space 4} -2.37099{col 67}{space 3}-1.656227
{txt}{space 10}x2 {c |}{col 14}{res}{space 2} 1.626859{col 26}{space 2} .0483657{col 37}{space 1}   33.64{col 46}{space 3}0.000{col 54}{space 4} 1.532064{col 67}{space 3} 1.721654
{txt}{space 10}x3 {c |}{col 14}{res}{space 2} -.183193{col 26}{space 2}  .005262{col 37}{space 1}  -34.81{col 46}{space 3}0.000{col 54}{space 4}-.1935063{col 67}{space 3}-.1728797
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 540.8132{col 26}{space 2} 15.54509{col 37}{space 1}   34.79{col 46}{space 3}0.000{col 54}{space 4} 510.3453{col 67}{space 3}  571.281
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 1716 observations completely determined.{txt}  Standard errors questionable.{p_end}

{com}. margins, dydx(*) vce(delta)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    10,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:x1 x2 x3}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:1._predict}:{space 1}{res:Pr(ydum==0), predict(pr outcome(0))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:2._predict}:{space 1}{res:Pr(ydum==1), predict(pr outcome(1))}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}x1           {txt}{c |}
{space 4}_predict {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.0806414{col 26}{space 2} .0069381{col 37}{space 1}  -11.62{col 46}{space 3}0.000{col 54}{space 4}-.0942398{col 67}{space 3}-.0670429
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .0806414{col 26}{space 2} .0069381{col 37}{space 1}   11.62{col 46}{space 3}0.000{col 54}{space 4} .0670429{col 67}{space 3} .0942398
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}x2           {txt}{c |}
{space 4}_predict {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0651528{col 26}{space 2} .0005486{col 37}{space 1}  118.77{col 46}{space 3}0.000{col 54}{space 4} .0640776{col 67}{space 3} .0662279
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0651528{col 26}{space 2} .0005486{col 37}{space 1} -118.77{col 46}{space 3}0.000{col 54}{space 4}-.0662279{col 67}{space 3}-.0640776
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}x3           {txt}{c |}
{space 4}_predict {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.0073365{col 26}{space 2} .0000234{col 37}{space 1} -314.06{col 46}{space 3}0.000{col 54}{space 4}-.0073823{col 67}{space 3}-.0072908
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .0073365{col 26}{space 2} .0000234{col 37}{space 1}  314.06{col 46}{space 3}0.000{col 54}{space 4} .0072908{col 67}{space 3} .0073823
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. 
. /// HW3
> //Exercise 1
. //Q1
. clear
{txt}
{com}. insheet using/Users/huangguo/Desktop/613/hw3/product.csv
{txt}(13 vars, 4,470 obs)

{com}. sort hhid
{txt}
{com}. save data1,replace
{txt}(note: file data1.dta not found)
file data1.dta saved

{com}. clear
{txt}
{com}. insheet using/Users/huangguo/Desktop/613/hw3/demos.csv
{txt}(9 vars, 516 obs)

{com}. save data2,replace
{txt}(note: file data2.dta not found)
file data2.dta saved

{com}. sort hhid
{txt}
{com}. merge 1:m hhid using data1.dta
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}           4,470{txt}  (_merge==3)
{col 5}{hline 41}

{com}. gen n = 4470
{txt}
{com}. gen v2 = _n
{txt}
{com}. summarize phse_stk ppk_tub ppk_stk pgen_stk pfl_tub phse_stk ppk_tub ppk_stk pgen_stk pfl_tub

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}phse_stk {c |}{res}      4,470    .4371476    .1188312        .19        .64
{txt}{space 5}ppk_tub {c |}{res}      4,470    1.077409    .0297261        .98       1.24
{txt}{space 5}ppk_stk {c |}{res}      4,470    .5184362    .1505174        .19        .67
{txt}{space 4}pgen_stk {c |}{res}      4,470    .3452819    .0351661        .25        .55
{txt}{space 5}pfl_tub {c |}{res}      4,470    1.189376    .0140545        .69       1.47
{txt}{hline 13}{c +}{hline 57}
{space 4}phse_stk {c |}{res}      4,470    .4371476    .1188312        .19        .64
{txt}{space 5}ppk_tub {c |}{res}      4,470    1.077409    .0297261        .98       1.24
{txt}{space 5}ppk_stk {c |}{res}      4,470    .5184362    .1505174        .19        .67
{txt}{space 4}pgen_stk {c |}{res}      4,470    .3452819    .0351661        .25        .55
{txt}{space 5}pfl_tub {c |}{res}      4,470    1.189376    .0140545        .69       1.47
{txt}
{com}. tab choice

     {txt}choice {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,766       39.51       39.51
{txt}          2 {c |}{res}        699       15.64       55.15
{txt}          3 {c |}{res}        243        5.44       60.58
{txt}          4 {c |}{res}        593       13.27       73.85
{txt}          5 {c |}{res}        315        7.05       80.89
{txt}          6 {c |}{res}         74        1.66       82.55
{txt}          7 {c |}{res}        319        7.14       89.69
{txt}          8 {c |}{res}        203        4.54       94.23
{txt}          9 {c |}{res}        225        5.03       99.26
{txt}         10 {c |}{res}         33        0.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. tab choice income

           {txt}{c |}                                               Income
    choice {c |}       2.5        7.5       12.5       17.5       22.5       27.5       32.5       37.5       42.5 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
         1 {c |}{res}        19        117        196        318        292        195        209        132        125 {txt}{c |}{res}     1,766 
{txt}         2 {c |}{res}         4         54        106        100        123         94         84         34         33 {txt}{c |}{res}       699 
{txt}         3 {c |}{res}         0         13         41         27         34          9         28         17         33 {txt}{c |}{res}       243 
{txt}         4 {c |}{res}         2         34         44        111        154         67         64         29         23 {txt}{c |}{res}       593 
{txt}         5 {c |}{res}         6         19         23         21        123         18         54         23          6 {txt}{c |}{res}       315 
{txt}         6 {c |}{res}         0          2          9          5          2          6          4          1         20 {txt}{c |}{res}        74 
{txt}         7 {c |}{res}        16         27         40         54         41         24         49         15         27 {txt}{c |}{res}       319 
{txt}         8 {c |}{res}         1          6          8         19         36         25         19         14         21 {txt}{c |}{res}       203 
{txt}         9 {c |}{res}         2         22         25         20         30         34         33          9         14 {txt}{c |}{res}       225 
{txt}        10 {c |}{res}         0          1          3          2          8          4          5          5          1 {txt}{c |}{res}        33 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}        50        295        495        677        843        476        549        279        303 {txt}{c |}{res}     4,470 


           {txt}{c |}                         Income
    choice {c |}      47.5         55       67.5       87.5        130 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         1 {c |}{res}        83         47         19          9          5 {txt}{c |}{res}     1,766 
{txt}         2 {c |}{res}        22         30          4         10          1 {txt}{c |}{res}       699 
{txt}         3 {c |}{res}        23         11          1          3          3 {txt}{c |}{res}       243 
{txt}         4 {c |}{res}        16         32          8          1          8 {txt}{c |}{res}       593 
{txt}         5 {c |}{res}         7          7          6          0          2 {txt}{c |}{res}       315 
{txt}         6 {c |}{res}        17          3          2          1          2 {txt}{c |}{res}        74 
{txt}         7 {c |}{res}         6         12          7          1          0 {txt}{c |}{res}       319 
{txt}         8 {c |}{res}         9         42          3          0          0 {txt}{c |}{res}       203 
{txt}         9 {c |}{res}         2         17          0         12          5 {txt}{c |}{res}       225 
{txt}        10 {c |}{res}         3          0          1          0          0 {txt}{c |}{res}        33 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res}       188        201         51         37         26 {txt}{c |}{res}     4,470 

{txt}
{com}. 
. //Q2
. //Use conditional logit model
. rename (ppk_stk pbb_stk pfl_stk phse_stk pgen_stk pimp_stk pss_tub ppk_tub pfl_tub phse_tub)(c1 c2 c3 c4 c5 c6 c7 c8 c9 c10)
{res}{txt}
{com}. reshape long c,i(v2) j(price)
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    4470   {txt}->{res}   44700
{txt}Number of variables            {res}      23   {txt}->{res}      15
{txt}j variable (10 values)                    ->   {res}price
{txt}xij variables:
                          {res}c1 c2 ... c10   {txt}->   {res}c
{txt}{hline 77}

{com}. gen dum = cond(price == choice,1,0)
{txt}
{com}. asclogit dum c,case(v2) alternatives(price)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7559.2014}  
Iteration 1:{space 3}log likelihood = {res:-7465.2594}  
Iteration 2:{space 3}log likelihood = {res:-7464.9321}  
Iteration 3:{space 3}log likelihood = {res:-7464.9321}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: v2{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: price{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}1{txt}){col 67}= {res}   1458.85
{txt}Log likelihood = {res}-7464.9321{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         dum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}price        {txt}{c |}
{space 11}c {c |}{col 14}{res}{space 2}-6.656579{col 26}{space 2} .1742793{col 37}{space 1}  -38.19{col 46}{space 3}0.000{col 54}{space 4} -6.99816{col 67}{space 3}-6.314998
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.9543068{col 26}{space 2} .0500462{col 37}{space 1}  -19.07{col 46}{space 3}0.000{col 54}{space 4}-1.052396{col 67}{space 3} -.856218
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.296968{col 26}{space 2} .1086515{col 37}{space 1}   11.94{col 46}{space 3}0.000{col 54}{space 4} 1.084015{col 67}{space 3} 1.509921
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.717332{col 26}{space 2} .0541582{col 37}{space 1}  -31.71{col 46}{space 3}0.000{col 54}{space 4} -1.82348{col 67}{space 3}-1.611184
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-2.904005{col 26}{space 2} .0714605{col 37}{space 1}  -40.64{col 46}{space 3}0.000{col 54}{space 4}-3.044065{col 67}{space 3}-2.763945
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.515311{col 26}{space 2} .1262303{col 37}{space 1}  -12.00{col 46}{space 3}0.000{col 54}{space 4}-1.762718{col 67}{space 3}-1.267904
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2517684{col 26}{space 2}  .079164{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .0966098{col 67}{space 3}  .406927
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.464868{col 26}{space 2} .1180467{col 37}{space 1}   12.41{col 46}{space 3}0.000{col 54}{space 4} 1.233501{col 67}{space 3} 1.696236
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.357505{col 26}{space 2}  .133774{col 37}{space 1}   17.62{col 46}{space 3}0.000{col 54}{space 4} 2.095313{col 67}{space 3} 2.619697
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-3.896594{col 26}{space 2}  .177419{col 37}{space 1}  -21.96{col 46}{space 3}0.000{col 54}{space 4}-4.244328{col 67}{space 3}-3.548859
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto c_logit
{txt}
{com}. estat mfx
{res}
{txt}Pr(choice = 1|1 selected) ={col 10}{res} .41862592
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:c}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-1.62007}}}{space 1}{space 1}{ralign 8:{res:{sf: .045076}}}{space 1}{space 1}{ralign 6:{res:{sf:-35.94}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.70841}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.53172}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .38092}}}{space 1}{space 1}{ralign 8:{res:{sf: .016377}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .348821}}}{space 1}{space 1}{ralign 8:{res:{sf: .413019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156526}}}{space 1}{space 1}{ralign 8:{res:{sf: .010709}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135537}}}{space 1}{space 1}{ralign 8:{res:{sf: .177515}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .359811}}}{space 1}{space 1}{ralign 8:{res:{sf: .016943}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .326602}}}{space 1}{space 1}{ralign 8:{res:{sf: .393019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .202435}}}{space 1}{space 1}{ralign 8:{res:{sf: .012376}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .178178}}}{space 1}{space 1}{ralign 8:{res:{sf: .226691}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .04471}}}{space 1}{space 1}{ralign 8:{res:{sf: .005301}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .034319}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0551}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .194866}}}{space 1}{space 1}{ralign 8:{res:{sf: .011804}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .171731}}}{space 1}{space 1}{ralign 8:{res:{sf: .218001}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .12222}}}{space 1}{space 1}{ralign 8:{res:{sf: .008972}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104636}}}{space 1}{space 1}{ralign 8:{res:{sf: .139804}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .14162}}}{space 1}{space 1}{ralign 8:{res:{sf: .009996}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .122027}}}{space 1}{space 1}{ralign 8:{res:{sf: .161213}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016959}}}{space 1}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011133}}}{space 1}{space 1}{ralign 8:{res:{sf: .022785}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 2|1 selected) ={col 10}{res} .13669617
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:c}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .38092}}}{space 1}{space 1}{ralign 8:{res:{sf: .016377}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .348821}}}{space 1}{space 1}{ralign 8:{res:{sf: .413019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.785545}}}{space 1}{space 1}{ralign 8:{res:{sf: .030158}}}{space 1}{space 1}{ralign 6:{res:{sf:-26.05}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.844654}}}{space 1}{space 1}{ralign 8:{res:{sf:-.726436}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051111}}}{space 1}{space 1}{ralign 8:{res:{sf: .003765}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.57}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043731}}}{space 1}{space 1}{ralign 8:{res:{sf: .058492}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117491}}}{space 1}{space 1}{ralign 8:{res:{sf: .006448}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104853}}}{space 1}{space 1}{ralign 8:{res:{sf: .130129}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066102}}}{space 1}{space 1}{ralign 8:{res:{sf: .004433}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057414}}}{space 1}{space 1}{ralign 8:{res:{sf:  .07479}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014599}}}{space 1}{space 1}{ralign 8:{res:{sf: .001779}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.20}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011112}}}{space 1}{space 1}{ralign 8:{res:{sf: .018087}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063631}}}{space 1}{space 1}{ralign 8:{res:{sf: .004253}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055295}}}{space 1}{space 1}{ralign 8:{res:{sf: .071966}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .039909}}}{space 1}{space 1}{ralign 8:{res:{sf: .003145}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.69}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .033744}}}{space 1}{space 1}{ralign 8:{res:{sf: .046074}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .046244}}}{space 1}{space 1}{ralign 8:{res:{sf: .003507}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03937}}}{space 1}{space 1}{ralign 8:{res:{sf: .053118}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005538}}}{space 1}{space 1}{ralign 8:{res:{sf: .000986}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003605}}}{space 1}{space 1}{ralign 8:{res:{sf: .007471}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 3|1 selected) ={col 10}{res} .05617075
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:c}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156526}}}{space 1}{space 1}{ralign 8:{res:{sf: .010709}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135537}}}{space 1}{space 1}{ralign 8:{res:{sf: .177515}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051111}}}{space 1}{space 1}{ralign 8:{res:{sf: .003765}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.57}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043731}}}{space 1}{space 1}{ralign 8:{res:{sf: .058492}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.352903}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02284}}}{space 1}{space 1}{ralign 6:{res:{sf:-15.45}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.397668}}}{space 1}{space 1}{ralign 8:{res:{sf:-.308137}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048279}}}{space 1}{space 1}{ralign 8:{res:{sf: .003651}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041124}}}{space 1}{space 1}{ralign 8:{res:{sf: .055434}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027162}}}{space 1}{space 1}{ralign 8:{res:{sf: .002319}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022618}}}{space 1}{space 1}{ralign 8:{res:{sf: .031707}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005999}}}{space 1}{space 1}{ralign 8:{res:{sf: .000796}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004438}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00756}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .026147}}}{space 1}{space 1}{ralign 8:{res:{sf: .002223}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02179}}}{space 1}{space 1}{ralign 8:{res:{sf: .030504}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016399}}}{space 1}{space 1}{ralign 8:{res:{sf: .001554}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .013354}}}{space 1}{space 1}{ralign 8:{res:{sf: .019444}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019002}}}{space 1}{space 1}{ralign 8:{res:{sf: .001757}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015559}}}{space 1}{space 1}{ralign 8:{res:{sf: .022445}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002276}}}{space 1}{space 1}{ralign 8:{res:{sf: .000422}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.40}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001449}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 4|1 selected) ={col 10}{res} .12912093
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:c}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .359811}}}{space 1}{space 1}{ralign 8:{res:{sf: .016943}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .326602}}}{space 1}{space 1}{ralign 8:{res:{sf: .393019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117491}}}{space 1}{space 1}{ralign 8:{res:{sf: .006448}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104853}}}{space 1}{space 1}{ralign 8:{res:{sf: .130129}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048279}}}{space 1}{space 1}{ralign 8:{res:{sf: .003651}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041124}}}{space 1}{space 1}{ralign 8:{res:{sf: .055434}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.748524}}}{space 1}{space 1}{ralign 8:{res:{sf: .031316}}}{space 1}{space 1}{ralign 6:{res:{sf:-23.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.809901}}}{space 1}{space 1}{ralign 8:{res:{sf:-.687146}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .062439}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00431}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.49}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .053992}}}{space 1}{space 1}{ralign 8:{res:{sf: .070886}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .01379}}}{space 1}{space 1}{ralign 8:{res:{sf: .001698}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.12}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .010462}}}{space 1}{space 1}{ralign 8:{res:{sf: .017118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060104}}}{space 1}{space 1}{ralign 8:{res:{sf: .004135}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:    .052}}}{space 1}{space 1}{ralign 8:{res:{sf: .068209}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .037698}}}{space 1}{space 1}{ralign 8:{res:{sf: .003025}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .031768}}}{space 1}{space 1}{ralign 8:{res:{sf: .043627}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043681}}}{space 1}{space 1}{ralign 8:{res:{sf: .003386}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .037046}}}{space 1}{space 1}{ralign 8:{res:{sf: .050317}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005231}}}{space 1}{space 1}{ralign 8:{res:{sf: .000933}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.60}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003402}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00706}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 5|1 selected) ={col 10}{res} .07264529
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:c}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .202435}}}{space 1}{space 1}{ralign 8:{res:{sf: .012376}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .178178}}}{space 1}{space 1}{ralign 8:{res:{sf: .226691}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066102}}}{space 1}{space 1}{ralign 8:{res:{sf: .004433}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057414}}}{space 1}{space 1}{ralign 8:{res:{sf:  .07479}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027162}}}{space 1}{space 1}{ralign 8:{res:{sf: .002319}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022618}}}{space 1}{space 1}{ralign 8:{res:{sf: .031707}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .062439}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00431}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.49}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .053992}}}{space 1}{space 1}{ralign 8:{res:{sf: .070886}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: -.44844}}}{space 1}{space 1}{ralign 8:{res:{sf: .025561}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.498539}}}{space 1}{space 1}{ralign 8:{res:{sf:-.398341}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007759}}}{space 1}{space 1}{ralign 8:{res:{sf: .001001}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.75}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005796}}}{space 1}{space 1}{ralign 8:{res:{sf: .009721}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033816}}}{space 1}{space 1}{ralign 8:{res:{sf: .002681}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.61}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028561}}}{space 1}{space 1}{ralign 8:{res:{sf: .039071}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .021209}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0019}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.16}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .017485}}}{space 1}{space 1}{ralign 8:{res:{sf: .024933}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024576}}}{space 1}{space 1}{ralign 8:{res:{sf: .002144}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020374}}}{space 1}{space 1}{ralign 8:{res:{sf: .028778}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002943}}}{space 1}{space 1}{ralign 8:{res:{sf: .000538}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001888}}}{space 1}{space 1}{ralign 8:{res:{sf: .003998}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 6|1 selected) ={col 10}{res} .01604447
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:c}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .04471}}}{space 1}{space 1}{ralign 8:{res:{sf: .005301}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .034319}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0551}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014599}}}{space 1}{space 1}{ralign 8:{res:{sf: .001779}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.20}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011112}}}{space 1}{space 1}{ralign 8:{res:{sf: .018087}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005999}}}{space 1}{space 1}{ralign 8:{res:{sf: .000796}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004438}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00756}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .01379}}}{space 1}{space 1}{ralign 8:{res:{sf: .001698}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.12}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .010462}}}{space 1}{space 1}{ralign 8:{res:{sf: .017118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007759}}}{space 1}{space 1}{ralign 8:{res:{sf: .001001}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.75}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005796}}}{space 1}{space 1}{ralign 8:{res:{sf: .009721}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.105088}}}{space 1}{space 1}{ralign 8:{res:{sf: .012245}}}{space 1}{space 1}{ralign 6:{res:{sf: -8.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.129087}}}{space 1}{space 1}{ralign 8:{res:{sf:-.081089}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007469}}}{space 1}{space 1}{ralign 8:{res:{sf: .000963}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005582}}}{space 1}{space 1}{ralign 8:{res:{sf: .009355}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004684}}}{space 1}{space 1}{ralign 8:{res:{sf: .000634}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003441}}}{space 1}{space 1}{ralign 8:{res:{sf: .005927}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005428}}}{space 1}{space 1}{ralign 8:{res:{sf: .000726}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004005}}}{space 1}{space 1}{ralign 8:{res:{sf: .006851}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00065}}}{space 1}{space 1}{ralign 8:{res:{sf: .000136}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.78}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 8:{res:{sf: .000916}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 7|1 selected) ={col 10}{res} .06992927
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:c}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .194866}}}{space 1}{space 1}{ralign 8:{res:{sf: .011804}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .171731}}}{space 1}{space 1}{ralign 8:{res:{sf: .218001}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063631}}}{space 1}{space 1}{ralign 8:{res:{sf: .004253}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055295}}}{space 1}{space 1}{ralign 8:{res:{sf: .071966}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .026147}}}{space 1}{space 1}{ralign 8:{res:{sf: .002223}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02179}}}{space 1}{space 1}{ralign 8:{res:{sf: .030504}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060104}}}{space 1}{space 1}{ralign 8:{res:{sf: .004135}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:    .052}}}{space 1}{space 1}{ralign 8:{res:{sf: .068209}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033816}}}{space 1}{space 1}{ralign 8:{res:{sf: .002681}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.61}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028561}}}{space 1}{space 1}{ralign 8:{res:{sf: .039071}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007469}}}{space 1}{space 1}{ralign 8:{res:{sf: .000963}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005582}}}{space 1}{space 1}{ralign 8:{res:{sf: .009355}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.432938}}}{space 1}{space 1}{ralign 8:{res:{sf: .024519}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.66}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.480995}}}{space 1}{space 1}{ralign 8:{res:{sf:-.384882}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020416}}}{space 1}{space 1}{ralign 8:{res:{sf: .001828}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .016833}}}{space 1}{space 1}{ralign 8:{res:{sf: .023999}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023657}}}{space 1}{space 1}{ralign 8:{res:{sf: .002057}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.50}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019625}}}{space 1}{space 1}{ralign 8:{res:{sf: .027689}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000518}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001817}}}{space 1}{space 1}{ralign 8:{res:{sf: .003849}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 8|1 selected) ={col 10}{res} .04385975
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:c}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .12222}}}{space 1}{space 1}{ralign 8:{res:{sf: .008972}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104636}}}{space 1}{space 1}{ralign 8:{res:{sf: .139804}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .039909}}}{space 1}{space 1}{ralign 8:{res:{sf: .003145}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.69}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .033744}}}{space 1}{space 1}{ralign 8:{res:{sf: .046074}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016399}}}{space 1}{space 1}{ralign 8:{res:{sf: .001554}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .013354}}}{space 1}{space 1}{ralign 8:{res:{sf: .019444}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .037698}}}{space 1}{space 1}{ralign 8:{res:{sf: .003025}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .031768}}}{space 1}{space 1}{ralign 8:{res:{sf: .043627}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .021209}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0019}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.16}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .017485}}}{space 1}{space 1}{ralign 8:{res:{sf: .024933}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004684}}}{space 1}{space 1}{ralign 8:{res:{sf: .000634}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003441}}}{space 1}{space 1}{ralign 8:{res:{sf: .005927}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020416}}}{space 1}{space 1}{ralign 8:{res:{sf: .001828}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .016833}}}{space 1}{space 1}{ralign 8:{res:{sf: .023999}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.279151}}}{space 1}{space 1}{ralign 8:{res:{sf: .019602}}}{space 1}{space 1}{ralign 6:{res:{sf:-14.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: -.31757}}}{space 1}{space 1}{ralign 8:{res:{sf:-.240731}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014838}}}{space 1}{space 1}{ralign 8:{res:{sf: .001434}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.35}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012027}}}{space 1}{space 1}{ralign 8:{res:{sf: .017649}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001777}}}{space 1}{space 1}{ralign 8:{res:{sf: .000334}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001123}}}{space 1}{space 1}{ralign 8:{res:{sf: .002431}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 9|1 selected) ={col 10}{res} .05082152
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:c}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .14162}}}{space 1}{space 1}{ralign 8:{res:{sf: .009996}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .122027}}}{space 1}{space 1}{ralign 8:{res:{sf: .161213}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .046244}}}{space 1}{space 1}{ralign 8:{res:{sf: .003507}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03937}}}{space 1}{space 1}{ralign 8:{res:{sf: .053118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019002}}}{space 1}{space 1}{ralign 8:{res:{sf: .001757}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015559}}}{space 1}{space 1}{ralign 8:{res:{sf: .022445}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043681}}}{space 1}{space 1}{ralign 8:{res:{sf: .003386}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .037046}}}{space 1}{space 1}{ralign 8:{res:{sf: .050317}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024576}}}{space 1}{space 1}{ralign 8:{res:{sf: .002144}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020374}}}{space 1}{space 1}{ralign 8:{res:{sf: .028778}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005428}}}{space 1}{space 1}{ralign 8:{res:{sf: .000726}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004005}}}{space 1}{space 1}{ralign 8:{res:{sf: .006851}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023657}}}{space 1}{space 1}{ralign 8:{res:{sf: .002057}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.50}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019625}}}{space 1}{space 1}{ralign 8:{res:{sf: .027689}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014838}}}{space 1}{space 1}{ralign 8:{res:{sf: .001434}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.35}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012027}}}{space 1}{space 1}{ralign 8:{res:{sf: .017649}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.321105}}}{space 1}{space 1}{ralign 8:{res:{sf: .021545}}}{space 1}{space 1}{ralign 6:{res:{sf:-14.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.363332}}}{space 1}{space 1}{ralign 8:{res:{sf:-.278878}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002059}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001306}}}{space 1}{space 1}{ralign 8:{res:{sf: .002811}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 10|1 selected) ={col 10}{res} .00608591
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:c}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016959}}}{space 1}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011133}}}{space 1}{space 1}{ralign 8:{res:{sf: .022785}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005538}}}{space 1}{space 1}{ralign 8:{res:{sf: .000986}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003605}}}{space 1}{space 1}{ralign 8:{res:{sf: .007471}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002276}}}{space 1}{space 1}{ralign 8:{res:{sf: .000422}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.40}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001449}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005231}}}{space 1}{space 1}{ralign 8:{res:{sf: .000933}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.60}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003402}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00706}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002943}}}{space 1}{space 1}{ralign 8:{res:{sf: .000538}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001888}}}{space 1}{space 1}{ralign 8:{res:{sf: .003998}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00065}}}{space 1}{space 1}{ralign 8:{res:{sf: .000136}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.78}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 8:{res:{sf: .000916}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000518}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001817}}}{space 1}{space 1}{ralign 8:{res:{sf: .003849}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001777}}}{space 1}{space 1}{ralign 8:{res:{sf: .000334}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001123}}}{space 1}{space 1}{ralign 8:{res:{sf: .002431}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002059}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001306}}}{space 1}{space 1}{ralign 8:{res:{sf: .002811}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.040265}}}{space 1}{space 1}{ralign 8:{res:{sf: .007011}}}{space 1}{space 1}{ralign 6:{res:{sf: -5.74}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.054006}}}{space 1}{space 1}{ralign 8:{res:{sf:-.026523}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

{com}. //Interpretation Q2.3: Because beta is negative, which indicates that the higher the price it is, the less utility that an individual will have by choosing the product, and the less likely it is that an individual is going to choose the product.
. //alfa1, alfa3, alfa4, alfa5,alfa9 are all negative, which indicates that compared with the product 1 (PPk_Stk), product 2,4,5,6,10 ( PBB_Stk, PHse_Stk,PGen_Stk,PImp_Stk,PHse_Tub) are less preferred and thus are less likely to be chosen given the same price.
. //alfa2, alfa6,alfa7, alfa8, are all positive, which indicates that compare with the product 1 (PPk_Stk), product 3,7,8,9 (PFl_Stk,PSS_Tub,PPk_Tub,PFl_Tub) are more preferred and thus they are more likely to be chosen given the same price.
. 
. //Q3&4
. asclogit d, case(v2) alternatives(price) casevar(income)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-8328.1129}  
Iteration 1:{space 3}log likelihood = {res:-8236.9407}  
Iteration 2:{space 3}log likelihood = {res: -8236.757}  
Iteration 3:{space 3}log likelihood = {res: -8236.757}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: v2{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: price{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}    101.55
{txt}Log likelihood = {res} -8236.757{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         dum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0030887{col 26}{space 2}  .003114{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4} -.009192{col 67}{space 3} .0030145
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8453241{col 26}{space 2} .0931354{col 37}{space 1}   -9.08{col 46}{space 3}0.000{col 54}{space 4}-1.027866{col 67}{space 3} -.662782
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0145862{col 26}{space 2} .0038255{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0070885{col 67}{space 3}  .022084
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.399858{col 26}{space 2} .1335802{col 37}{space 1}  -17.97{col 46}{space 3}0.000{col 54}{space 4} -2.66167{col 67}{space 3}-2.138045
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0040504{col 26}{space 2} .0030926{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4}-.0020109{col 67}{space 3} .0101118
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.201326{col 26}{space 2} .0971021{col 37}{space 1}  -12.37{col 46}{space 3}0.000{col 54}{space 4}-1.391643{col 67}{space 3} -1.01101
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0012536{col 26}{space 2} .0042024{col 37}{space 1}   -0.30{col 46}{space 3}0.765{col 54}{space 4}-.0094901{col 67}{space 3} .0069829
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.690582{col 26}{space 2} .1269952{col 37}{space 1}  -13.31{col 46}{space 3}0.000{col 54}{space 4}-1.939488{col 67}{space 3}-1.441676
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .030612{col 26}{space 2}  .004674{col 37}{space 1}    6.55{col 46}{space 3}0.000{col 54}{space 4} .0214512{col 67}{space 3} .0397729
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.139767{col 26}{space 2}  .210989{col 37}{space 1}  -19.62{col 46}{space 3}0.000{col 54}{space 4}-4.553298{col 67}{space 3}-3.726236
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0069326{col 26}{space 2} .0044161{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4} -.015588{col 67}{space 3} .0017228
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.531042{col 26}{space 2} .1280434{col 37}{space 1}  -11.96{col 46}{space 3}0.000{col 54}{space 4}-1.782002{col 67}{space 3}-1.280081
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0228862{col 26}{space 2} .0036217{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 54}{space 4} .0157878{col 67}{space 3} .0299845
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.848352{col 26}{space 2} .1393848{col 37}{space 1}  -20.44{col 46}{space 3}0.000{col 54}{space 4}-3.121541{col 67}{space 3}-2.575163
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .017743{col 26}{space 2} .0037623{col 37}{space 1}    4.72{col 46}{space 3}0.000{col 54}{space 4}  .010369{col 67}{space 3} .0251169
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.575597{col 26}{space 2}   .13614{col 37}{space 1}  -18.92{col 46}{space 3}0.000{col 54}{space 4}-2.842427{col 67}{space 3}-2.308768
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0107909{col 26}{space 2}   .01013{col 37}{space 1}    1.07{col 46}{space 3}0.287{col 54}{space 4}-.0090636{col 67}{space 3} .0306454
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -4.28227{col 26}{space 2}  .345792{col 37}{space 1}  -12.38{col 46}{space 3}0.000{col 54}{space 4} -4.96001{col 67}{space 3} -3.60453
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto m_logit
{txt}
{com}. estat mfx
{res}
{txt}Pr(choice = 1|1 selected) ={col 10}{res} .39801715
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.001062}}}{space 1}{space 1}{ralign 8:{res:{sf: .000487}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.029}}}{space 1}{space 1}{ralign 8:{res:{sf:-.002016}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000108}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 2|1 selected) ={col 10}{res} .15691817
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000904}}}{space 1}{space 1}{ralign 8:{res:{sf: .000378}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.017}}}{space 1}{space 1}{ralign 8:{res:{sf:-.001645}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000162}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 3|1 selected) ={col 10}{res} .05406295
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000644}}}{space 1}{space 1}{ralign 8:{res:{sf: .000183}}}{space 1}{space 1}{ralign 6:{res:{sf:  3.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000286}}}{space 1}{space 1}{ralign 8:{res:{sf: .001002}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 4|1 selected) ={col 10}{res} .13391688
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000185}}}{space 1}{space 1}{ralign 8:{res:{sf: .000329}}}{space 1}{space 1}{ralign 6:{res:{sf:  0.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.574}}}{space 1}{space 1}{ralign 8:{res:{sf: -.00046}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00083}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 5|1 selected) ={col 10}{res} .07089742
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000278}}}{space 1}{space 1}{ralign 8:{res:{sf: .000264}}}{space 1}{space 1}{ralign 6:{res:{sf: -1.06}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.291}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000795}}}{space 1}{space 1}{ralign 8:{res:{sf: .000238}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 6|1 selected) ={col 10}{res} .01478443
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000413}}}{space 1}{space 1}{ralign 8:{res:{sf: .000066}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000283}}}{space 1}{space 1}{ralign 8:{res:{sf: .000543}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 7|1 selected) ={col 10}{res} .07107045
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000682}}}{space 1}{space 1}{ralign 8:{res:{sf: .000277}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.014}}}{space 1}{space 1}{ralign 8:{res:{sf:-.001224}}}{space 1}{space 1}{ralign 8:{res:{sf: -.00014}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 8|1 selected) ={col 10}{res} .04343487
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000878}}}{space 1}{space 1}{ralign 8:{res:{sf: .000138}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.38}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000608}}}{space 1}{space 1}{ralign 8:{res:{sf: .001148}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 9|1 selected) ={col 10}{res} .04948833
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000746}}}{space 1}{space 1}{ralign 8:{res:{sf: .000164}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.55}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000425}}}{space 1}{space 1}{ralign 8:{res:{sf: .001067}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 10|1 selected) ={col 10}{res} .00740936
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00006}}}{space 1}{space 1}{ralign 8:{res:{sf: .000074}}}{space 1}{space 1}{ralign 6:{res:{sf:  0.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.413}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000084}}}{space 1}{space 1}{ralign 8:{res:{sf: .000204}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

{com}. 
. //Q5
. asmixlogit dum, random(c) casevar(income) alternatives(price) case(v2)
{res}
{txt}Fitting fixed parameter model:
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 3}log simulated likelihood = {res:-7416.2546}  (not concave)
Iteration 1:{space 3}log simulated likelihood = {res:-7398.1945}  
Iteration 2:{space 3}log simulated likelihood = {res:-7355.6322}  
Iteration 3:{space 3}log simulated likelihood = {res:-7352.5988}  
Iteration 4:{space 3}log simulated likelihood = {res:-7352.5814}  
Iteration 5:{space 3}log simulated likelihood = {res:-7352.5814}  
{res}
{txt}Alternative-specific mixed logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: {res}v2{txt}{col 48}Number of cases{col 67}= {res}     4,470

{txt}Alternative variable: {res}price{txt}{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10
{txt}Integration sequence:      {res}Hammersley
{txt}Integration points:   {res}             50{txt}{col 51}Wald chi2({res}10{txt}){col 67}= {res}   1211.55
{txt}Log simulated likelihood = {res}-7352.5814{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         dum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}price        {txt}{c |}
{space 11}c {c |}{col 14}{res}{space 2}-7.547198{col 26}{space 2} .2223547{col 37}{space 1}  -33.94{col 46}{space 3}0.000{col 54}{space 4}-7.983005{col 67}{space 3}-7.111391
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Normal       {txt}{c |}
{space 8}sd(c){c |}{col 14}{res}{space 2} 3.649194{col 26}{space 2}  .291882{col 54}{space 4} 3.119703{col 67}{space 3} 4.268552
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0058937{col 26}{space 2} .0036744{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 54}{space 4}-.0130955{col 67}{space 3}  .001308
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8886583{col 26}{space 2} .1104599{col 37}{space 1}   -8.05{col 46}{space 3}0.000{col 54}{space 4}-1.105156{col 67}{space 3}-.6721609
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0202033{col 26}{space 2} .0046021{col 37}{space 1}    4.39{col 46}{space 3}0.000{col 54}{space 4} .0111834{col 67}{space 3} .0292232
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .3624811{col 26}{space 2} .2026931{col 37}{space 1}    1.79{col 46}{space 3}0.074{col 54}{space 4}-.0347902{col 67}{space 3} .7597523
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0025691{col 26}{space 2} .0034659{col 37}{space 1}    0.74{col 46}{space 3}0.459{col 54}{space 4} -.004224{col 67}{space 3} .0093622
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.025266{col 26}{space 2} .1126402{col 37}{space 1}  -17.98{col 46}{space 3}0.000{col 54}{space 4}-2.246037{col 67}{space 3}-1.804495
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} -.003862{col 26}{space 2} .0045853{col 37}{space 1}   -0.84{col 46}{space 3}0.400{col 54}{space 4} -.012849{col 67}{space 3}  .005125
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.383501{col 26}{space 2} .1540533{col 37}{space 1}  -21.96{col 46}{space 3}0.000{col 54}{space 4} -3.68544{col 67}{space 3}-3.081562
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0324638{col 26}{space 2} .0049366{col 37}{space 1}    6.58{col 46}{space 3}0.000{col 54}{space 4} .0227883{col 67}{space 3} .0421394
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.521205{col 26}{space 2} .2228586{col 37}{space 1}  -11.31{col 46}{space 3}0.000{col 54}{space 4}   -2.958{col 67}{space 3} -2.08441
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0061804{col 26}{space 2} .0047636{col 37}{space 1}   -1.30{col 46}{space 3}0.194{col 54}{space 4}-.0155168{col 67}{space 3}  .003156
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4032682{col 26}{space 2} .1520697{col 37}{space 1}    2.65{col 46}{space 3}0.008{col 54}{space 4}  .105217{col 67}{space 3} .7013193
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0292799{col 26}{space 2}  .004687{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4} .0200936{col 67}{space 3} .0384662
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0961353{col 26}{space 2} .2292829{col 37}{space 1}    0.42{col 46}{space 3}0.675{col 54}{space 4} -.353251{col 67}{space 3} .5455217
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0258758{col 26}{space 2} .0051442{col 37}{space 1}    5.03{col 46}{space 3}0.000{col 54}{space 4} .0157934{col 67}{space 3} .0359583
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7081915{col 26}{space 2} .2768591{col 37}{space 1}    2.56{col 46}{space 3}0.011{col 54}{space 4} .1655576{col 67}{space 3} 1.250825
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0065357{col 26}{space 2}  .010873{col 37}{space 1}    0.60{col 46}{space 3}0.548{col 54}{space 4}-.0147751{col 67}{space 3} .0278465
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.412742{col 26}{space 2} .3674048{col 37}{space 1}  -12.01{col 46}{space 3}0.000{col 54}{space 4}-5.132842{col 67}{space 3}-3.692641
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
LR test vs. fixed parameters: {help j_chibar##|_new:chibar2(01) =} {res}  130.70{txt}{col 55}Prob >= chibar2 = {res}{col 73}0.0000
{txt}
{com}. estimate store haha
{txt}
{com}. drop if choice == 10
{txt}(330 observations deleted)

{com}. drop if price == 10
{txt}(4,437 observations deleted)

{com}. asmixlogit dum, random(c) casevar(income) alternative(price) case(v2)
{res}
{txt}Fitting fixed parameter model:
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 3}log simulated likelihood = {res:-7238.4991}  (not concave)
Iteration 1:{space 3}log simulated likelihood = {res:-7218.2886}  
Iteration 2:{space 3}log simulated likelihood = {res:-7173.5145}  
Iteration 3:{space 3}log simulated likelihood = {res:-7171.0366}  
Iteration 4:{space 3}log simulated likelihood = {res:-7171.0302}  
Iteration 5:{space 3}log simulated likelihood = {res:-7171.0302}  
{res}
{txt}Alternative-specific mixed logit{col 48}Number of obs{col 67}= {res}    39,933
{txt}Case variable: {res}v2{txt}{col 48}Number of cases{col 67}= {res}     4,437

{txt}Alternative variable: {res}price{txt}{col 48}Alts per case: min = {res}         9
{col 63}{txt}avg = {res}       9.0
{col 63}{txt}max = {res}         9
{txt}Integration sequence:      {res}Hammersley
{txt}Integration points:   {res}             50{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}   1146.94
{txt}Log simulated likelihood = {res}-7171.0302{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         dum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}price        {txt}{c |}
{space 11}c {c |}{col 14}{res}{space 2}-7.682409{col 26}{space 2} .2324916{col 37}{space 1}  -33.04{col 46}{space 3}0.000{col 54}{space 4}-8.138084{col 67}{space 3}-7.226733
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Normal       {txt}{c |}
{space 8}sd(c){c |}{col 14}{res}{space 2} 3.800923{col 26}{space 2} .3038365{col 54}{space 4} 3.249721{col 67}{space 3} 4.445617
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0058322{col 26}{space 2} .0036865{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-.0130577{col 67}{space 3} .0013933
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8990062{col 26}{space 2} .1108781{col 37}{space 1}   -8.11{col 46}{space 3}0.000{col 54}{space 4}-1.116323{col 67}{space 3}-.6816892
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .020762{col 26}{space 2}  .004655{col 37}{space 1}    4.46{col 46}{space 3}0.000{col 54}{space 4} .0116383{col 67}{space 3} .0298857
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .3657732{col 26}{space 2} .2056176{col 37}{space 1}    1.78{col 46}{space 3}0.075{col 54}{space 4}-.0372298{col 67}{space 3} .7687763
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .002387{col 26}{space 2} .0034768{col 37}{space 1}    0.69{col 46}{space 3}0.492{col 54}{space 4}-.0044274{col 67}{space 3} .0092015
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.042462{col 26}{space 2} .1133201{col 37}{space 1}  -18.02{col 46}{space 3}0.000{col 54}{space 4}-2.264566{col 67}{space 3}-1.820359
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0045297{col 26}{space 2} .0046257{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-.0135959{col 67}{space 3} .0045364
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.429965{col 26}{space 2} .1567892{col 37}{space 1}  -21.88{col 46}{space 3}0.000{col 54}{space 4}-3.737266{col 67}{space 3}-3.122664
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0326799{col 26}{space 2} .0049492{col 37}{space 1}    6.60{col 46}{space 3}0.000{col 54}{space 4} .0229796{col 67}{space 3} .0423802
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.508699{col 26}{space 2} .2233818{col 37}{space 1}  -11.23{col 46}{space 3}0.000{col 54}{space 4} -2.94652{col 67}{space 3}-2.070879
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0058333{col 26}{space 2} .0047736{col 37}{space 1}   -1.22{col 46}{space 3}0.222{col 54}{space 4}-.0151894{col 67}{space 3} .0035227
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4157664{col 26}{space 2} .1529337{col 37}{space 1}    2.72{col 46}{space 3}0.007{col 54}{space 4} .1160218{col 67}{space 3}  .715511
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0298916{col 26}{space 2} .0047549{col 37}{space 1}    6.29{col 46}{space 3}0.000{col 54}{space 4} .0205722{col 67}{space 3}  .039211
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0940732{col 26}{space 2} .2329927{col 37}{space 1}    0.40{col 46}{space 3}0.686{col 54}{space 4}-.3625841{col 67}{space 3} .5507305
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0266457{col 26}{space 2} .0052373{col 37}{space 1}    5.09{col 46}{space 3}0.000{col 54}{space 4} .0163808{col 67}{space 3} .0369106
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6893077{col 26}{space 2} .2824188{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4} .1357771{col 67}{space 3} 1.242838
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
LR test vs. fixed parameters: {help j_chibar##|_new:chibar2(01) =} {res}  138.35{txt}{col 55}Prob >= chibar2 = {res}{col 73}0.0000
{txt}
{com}. estimate store hahapartial
{txt}
{com}. hausman hahapartial haha, alleqs constant

{txt}{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17}hahapartial {col 30}    haha    {col 46}Difference{col 66}S.E.
{hline 13}{c +}{hline 64}
{res}price{col 14}{txt}{c |}
{space 11}c {c |}{res}{col 18}-7.682409{col 31}-7.547198{col 47}-.1352107{col 63} .0679025
{txt}{hline 13}{c +}{hline 64}
{res}Normal{col 14}{txt}{c |}
{space 8}sd(c){c |}{res}{col 18} 3.800923{col 31} 3.649194{col 47} .1517296{col 63} .0843891
{txt}{hline 13}{c +}{hline 64}
{res}2{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18}-.0058322{col 31}-.0058937{col 47} .0000615{col 63} .0002985
{txt}{space 7}_cons {c |}{res}{col 18}-.8990062{col 31}-.8886583{col 47}-.0103479{col 63} .0096209
{txt}{hline 13}{c +}{hline 64}
{res}3{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18}  .020762{col 31} .0202033{col 47} .0005587{col 63} .0007001
{txt}{space 7}_cons {c |}{res}{col 18} .3657732{col 31} .3624811{col 47} .0032921{col 63} .0345555
{txt}{hline 13}{c +}{hline 64}
{res}4{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18}  .002387{col 31} .0025691{col 47}-.0001821{col 63} .0002748
{txt}{space 7}_cons {c |}{res}{col 18}-2.042462{col 31}-2.025266{col 47}-.0171966{col 63} .0123948
{txt}{hline 13}{c +}{hline 64}
{res}5{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18}-.0045297{col 31} -.003862{col 47}-.0006678{col 63} .0006098
{txt}{space 7}_cons {c |}{res}{col 18}-3.429965{col 31}-3.383501{col 47}-.0464637{col 63} .0291619
{txt}{hline 13}{c +}{hline 64}
{res}6{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18} .0326799{col 31} .0324638{col 47} .0002161{col 63} .0003535
{txt}{space 7}_cons {c |}{res}{col 18}-2.508699{col 31}-2.521205{col 47} .0125056{col 63} .0152798
{txt}{hline 13}{c +}{hline 64}
{res}7{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18}-.0058333{col 31}-.0061804{col 47}  .000347{col 63} .0003094
{txt}{space 7}_cons {c |}{res}{col 18} .4157664{col 31} .4032682{col 47} .0124982{col 63} .0162333
{txt}{hline 13}{c +}{hline 64}
{res}8{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18} .0298916{col 31} .0292799{col 47} .0006117{col 63} .0008009
{txt}{space 7}_cons {c |}{res}{col 18} .0940732{col 31} .0961353{col 47}-.0020621{col 63} .0414118
{txt}{hline 13}{c +}{hline 64}
{res}9{col 14}{txt}{c |}
{space 6}income {c |}{res}{col 18} .0266457{col 31} .0258758{col 47} .0007698{col 63}  .000983
{txt}{space 7}_cons {c |}{res}{col 18} .6893077{col 31} .7081915{col 47}-.0188837{col 63} .0557621
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = consistent under Ho and Ha; obtained from asmixlogit}
{ralign 78:B = inconsistent under Ha, efficient under Ho; obtained from asmixlogit}

    Test:  Ho:  difference in coefficients not systematic

{ralign 25:chi2({res:18})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{col 27}=  {res}      5.59
{txt}{col 17}Prob>chi2 =  {res}    0.9976
{txt}{col 17}(V_b-V_B is not positive definite)

{com}. //The result of hausman test shows that we can hardly reject IIA. The reason might be that the sample of the product 10 is too small to show any significant difference if we remove its observations
. 
. 
. //HW4
. clear
{txt}
{com}. insheet using /Users/huangguo/Desktop/613/hw4/Koop-Tobias.csv,names
{txt}(10 vars, 17,919 obs)

{com}. //convert data into panel data
. xtset personid timetrnd
{res}{txt}{col 8}panel variable:  {res}personid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}timetrnd, 0 to 14, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. bysort personid: gen t = _n
{txt}
{com}. //Represent the panel dimension of wages for 5 randomly selected individuals
. tabulate timetrnd logwage if personid == 3

           {txt}{c |}  LOGWAGE
  TIMETRND {c |}      1.56 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         1 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res}         1 {txt}{c |}{res}         1 

{txt}
{com}. tabulate timetrnd logwage if personid == 13

           {txt}{c |}                                              LOGWAGE
  TIMETRND {c |}      1.57       1.88       2.03       2.07       2.09       2.35       2.48       2.52       2.59 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
         0 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         2 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         3 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         4 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}         5 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}         7 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         9 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}        10 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}        11 {c |}{res}         0          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}        12 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}        13 {c |}{res}         0          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}        14 {c |}{res}         0          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          1          1 {txt}{c |}{res}        12 


           {txt}{c |}             LOGWAGE
  TIMETRND {c |}      2.63       3.46       3.88 {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
         0 {c |}{res}         0          0          0 {txt}{c |}{res}         1 
{txt}         2 {c |}{res}         0          0          0 {txt}{c |}{res}         1 
{txt}         3 {c |}{res}         0          0          0 {txt}{c |}{res}         1 
{txt}         4 {c |}{res}         0          0          0 {txt}{c |}{res}         1 
{txt}         5 {c |}{res}         0          0          0 {txt}{c |}{res}         1 
{txt}         7 {c |}{res}         0          0          0 {txt}{c |}{res}         1 
{txt}         9 {c |}{res}         0          0          0 {txt}{c |}{res}         1 
{txt}        10 {c |}{res}         0          0          0 {txt}{c |}{res}         1 
{txt}        11 {c |}{res}         1          0          0 {txt}{c |}{res}         1 
{txt}        12 {c |}{res}         0          0          0 {txt}{c |}{res}         1 
{txt}        13 {c |}{res}         0          1          0 {txt}{c |}{res}         1 
{txt}        14 {c |}{res}         0          0          1 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}         1          1          1 {txt}{c |}{res}        12 

{txt}
{com}. tabulate timetrnd logwage if personid == 133

           {txt}{c |}                                              LOGWAGE
  TIMETRND {c |}      1.71       2.07       2.19       2.23       2.33       2.34       2.39        2.4       2.47 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
         2 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         3 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         4 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         6 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}         8 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         9 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}        10 {c |}{res}         0          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}        11 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}        12 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}        13 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}        14 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1          1          1          2          1 {txt}{c |}{res}        11 


           {txt}{c |}  LOGWAGE
  TIMETRND {c |}      2.76 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}         3 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}         4 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}         6 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}         8 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}         9 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}        10 {c |}{res}         1 {txt}{c |}{res}         1 
{txt}        11 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}        12 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}        13 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}        14 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res}         1 {txt}{c |}{res}        11 

{txt}
{com}. tabulate timetrnd logwage if personid == 1133

           {txt}{c |}                                              LOGWAGE
  TIMETRND {c |}      1.85       1.91       2.07       2.08        2.1       2.32       2.44       2.45       2.63 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
         1 {c |}{res}         0          1          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         4 {c |}{res}         0          0          0          1          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         5 {c |}{res}         1          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         6 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         7 {c |}{res}         0          0          1          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}         8 {c |}{res}         0          0          0          0          1          0          0          0          0 {txt}{c |}{res}         1 
{txt}         9 {c |}{res}         0          0          0          0          0          1          0          0          0 {txt}{c |}{res}         1 
{txt}        10 {c |}{res}         0          0          0          0          0          0          0          1          0 {txt}{c |}{res}         1 
{txt}        11 {c |}{res}         0          0          0          0          0          0          1          0          0 {txt}{c |}{res}         1 
{txt}        12 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}        13 {c |}{res}         0          0          0          0          0          0          0          0          0 {txt}{c |}{res}         1 
{txt}        14 {c |}{res}         0          0          0          0          0          0          0          0          1 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         1          1          2          1          1          1          1          1          2 {txt}{c |}{res}        12 


           {txt}{c |}  LOGWAGE
  TIMETRND {c |}      2.77 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         1 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}         4 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}         5 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}         6 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}         7 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}         8 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}         9 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}        10 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}        11 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}        12 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}        13 {c |}{res}         1 {txt}{c |}{res}         1 
{txt}        14 {c |}{res}         0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res}         1 {txt}{c |}{res}        12 

{txt}
{com}. tabulate timetrnd logwage if personid == 1333

           {txt}{c |}                        LOGWAGE
  TIMETRND {c |}       1.9       2.06       2.32       2.35       2.37 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         4 {c |}{res}         0          1          0          0          0 {txt}{c |}{res}         1 
{txt}         5 {c |}{res}         1          0          0          0          0 {txt}{c |}{res}         1 
{txt}         6 {c |}{res}         0          0          0          1          0 {txt}{c |}{res}         1 
{txt}         7 {c |}{res}         0          0          0          0          1 {txt}{c |}{res}         1 
{txt}        11 {c |}{res}         0          0          1          0          0 {txt}{c |}{res}         1 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res}         1          1          1          1          1 {txt}{c |}{res}         5 

{txt}
{com}. 
. //Q 2
. //Random effect model
. xtreg logwage educ potexper, re
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}    17,919
{txt}Group variable: {res}personid                        {txt}Number of groups  = {res}     2,178

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1961                                         {txt}min = {res}         1
{txt}     between = {res}0.1533                                         {txt}avg = {res}       8.2
{txt}     overall = {res}0.1578                                         {txt}max = {res}        15

                                                {txt}Wald chi2({res}2{txt})      =  {res}  4209.96
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}  .107938{col 26}{space 2} .0033832{col 37}{space 1}   31.90{col 46}{space 3}0.000{col 54}{space 4} .1013071{col 67}{space 3}  .114569
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0387645{col 26}{space 2} .0007178{col 37}{space 1}   54.00{col 46}{space 3}0.000{col 54}{space 4} .0373576{col 67}{space 3} .0401714
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5635206{col 26}{space 2} .0438846{col 37}{space 1}   12.84{col 46}{space 3}0.000{col 54}{space 4} .4775083{col 67}{space 3} .6495328
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .37207276
     {txt}sigma_e {c |} {res} .33545728
         {txt}rho {c |} {res}  .5516129{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. 
. //Q 3
. //Fixed effect model
. //Between Estimator 
. xtreg logwage educ potexper,be 

{txt}Between regression (regression on group means)  Number of obs     = {res}    17,919
{txt}Group variable: {res}personid                        {txt}Number of groups  = {res}     2,178

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1962                                         {txt}min = {res}         1
{txt}     between = {res}0.1553                                         {txt}avg = {res}       8.2
{txt}     overall = {res}0.1518                                         {txt}max = {res}        15

                                                {txt}F({res}2{txt},{res}2175{txt})         =  {res}   200.01
{txt}sd(u_i + avg(e_i.))= {res} .3991313                  {txt}Prob > F          =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .0930999{col 26}{space 2} .0046685{col 37}{space 1}   19.94{col 46}{space 3}0.000{col 54}{space 4} .0839447{col 67}{space 3} .1022551
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0259987{col 26}{space 2} .0036049{col 37}{space 1}    7.21{col 46}{space 3}0.000{col 54}{space 4} .0189294{col 67}{space 3} .0330681
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8455688{col 26}{space 2} .0770179{col 37}{space 1}   10.98{col 46}{space 3}0.000{col 54}{space 4} .6945324{col 67}{space 3} .9966052
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //Within Estimator 
. xtreg logwage educ potexper,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,919
{txt}Group variable: {res}personid{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,178

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1964{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1550{col 63}{txt}avg{col 67}={col 69}{res}       8.2
{txt}     overall = {res}0.1551{col 63}{txt}max{col 67}={col 69}{res}        15

{txt}{col 49}F({res}2{txt},{res}15739{txt}){col 67}={col 70}{res}  1923.47
{txt}corr(u_i, Xb){col 16}= {res}-0.1273{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}  .123662{col 26}{space 2} .0057619{col 37}{space 1}   21.46{col 46}{space 3}0.000{col 54}{space 4} .1123681{col 67}{space 3} .1349559
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0385611{col 26}{space 2} .0007585{col 37}{space 1}   50.84{col 46}{space 3}0.000{col 54}{space 4} .0370744{col 67}{space 3} .0400478
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4068016{col 26}{space 2} .0717348{col 37}{space 1}    5.67{col 46}{space 3}0.000{col 54}{space 4} .2661931{col 67}{space 3}   .54741
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .40290853
     {txt}sigma_e {c |} {res} .33545728
         {txt}rho {c |} {res} .59059603{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}2177{txt}, {res}15739{txt}) = {res}9.95{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. //First time difference estimator 
. xtset personid t
{res}{txt}{col 8}panel variable:  {res}personid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}t, 1 to 15
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtdes

{txt}personid:  {res}1{txt}, {res}2{txt}, ..., {res}2178                                   {txt}n ={res}       2178
       {txt}t:  {res}1, 2, ..., 15                                     {txt}T ={res}         15
           {txt}Delta(t) = {res}1 unit
           {txt}Span(t)  = {res}15 periods
           {txt}(personid*t uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     1       2       5         8        11      14      15

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 15}
{res}      202      9.27    9.27{txt} {c |}  {res}11111111.......
      202      9.27   18.55{txt} {c |}  {res}1111111111.....
      201      9.23   27.78{txt} {c |}  {res}1111111........
      200      9.18   36.96{txt} {c |}  {res}111111111......
      182      8.36   45.32{txt} {c |}  {res}11111111111....
      165      7.58   52.89{txt} {c |}  {res}111111.........
      148      6.80   59.69{txt} {c |}  {res}11111..........
      148      6.80   66.48{txt} {c |}  {res}111111111111...
      136      6.24   72.73{txt} {c |}  {res}1111111111111..
      594     27.27  100.00{txt} {c |} (other patterns)
 {hline 27}{c +}{c -}{c -}{hline 15}
{res}     2178    100.00        {txt} {c |}  {res}XXXXXXXXXXXXXXX
{txt}
{com}. gen logwage_D = D.logwage
{txt}(2,178 missing values generated)

{com}. gen educ_D = D.educ
{txt}(2,178 missing values generated)

{com}. gen potexper_D = D.potexper
{txt}(2,178 missing values generated)

{com}. xtreg logwage_D educ_D potexper_D, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    15,741
{txt}Group variable: {res}personid{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,095

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0008{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0010{col 63}{txt}avg{col 67}={col 69}{res}       7.5
{txt}     overall = {res}0.0010{col 63}{txt}max{col 67}={col 69}{res}        14

{txt}{col 49}F({res}2{txt},{res}13644{txt}){col 67}={col 70}{res}     5.32
{txt}corr(u_i, Xb){col 16}= {res}-0.0017{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0049

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   logwage_D{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}educ_D {c |}{col 14}{res}{space 2} .0218726{col 26}{space 2} .0097279{col 37}{space 1}    2.25{col 46}{space 3}0.025{col 54}{space 4} .0028047{col 67}{space 3} .0409406
{txt}{space 2}potexper_D {c |}{col 14}{res}{space 2} .0114422{col 26}{space 2} .0047082{col 37}{space 1}    2.43{col 46}{space 3}0.015{col 54}{space 4} .0022133{col 67}{space 3}  .020671
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0419012{col 26}{space 2} .0064347{col 37}{space 1}    6.51{col 46}{space 3}0.000{col 54}{space 4} .0292883{col 67}{space 3} .0545141
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res}  .1752942
     {txt}sigma_e {c |} {res} .39181966
         {txt}rho {c |} {res} .16677308{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}2094{txt}, {res}13644{txt}) = {res}0.49{col 62}{txt}Prob > F = {res}1.0000
{txt}
{com}. //Q4
. mlexp (ln(normalden(logwage, {c -(}b0{c )-} + {c -(}b1{c )-}*educ+ {c -(}b2{c )-}*potexper, {c -(}sigma{c )-})))
{res}
{txt}initial:{col 16}log likelihood = {res:    -<inf>}  (could not be evaluated)
feasible:{col 16}log likelihood = {res:-2868239.3}
rescale:{col 16}log likelihood = {res:-305713.87}
rescale eq:{col 16}log likelihood = {res:-17181.577}
Iteration 0:{space 3}log likelihood = {res:-17181.577}  
Iteration 1:{space 3}log likelihood = {res:-13557.798}  
Iteration 2:{space 3}log likelihood = {res:-12456.274}  
Iteration 3:{space 3}log likelihood = {res:-12443.861}  
Iteration 4:{space 3}log likelihood = {res:-12443.799}  
Iteration 5:{space 3}log likelihood = {res:-12443.799}  

Maximum likelihood estimation

Log likelihood = {res}-12443.799{txt}{col 49}Number of obs{col 67}= {res}    17,919

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /b0 {c |}{col 14}{res}{space 2} .7941911{col 26}{space 2}  .027357{col 37}{space 1}   29.03{col 46}{space 3}0.000{col 54}{space 4} .7405724{col 67}{space 3} .8478098
{txt}         /b1 {c |}{col 14}{res}{space 2} .0938637{col 26}{space 2} .0019298{col 37}{space 1}   48.64{col 46}{space 3}0.000{col 54}{space 4} .0900815{col 67}{space 3}  .097646
{txt}         /b2 {c |}{col 14}{res}{space 2} .0374053{col 26}{space 2} .0008988{col 37}{space 1}   41.62{col 46}{space 3}0.000{col 54}{space 4} .0356437{col 67}{space 3} .0391669
{txt}      /sigma {c |}{col 14}{res}{space 2}  .484571{col 26}{space 2} .0025597{col 37}{space 1}  189.31{col 46}{space 3}0.000{col 54}{space 4} .4795541{col 67}{space 3} .4895879
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //Q4.3
. //The standard errors in the previous model are wrong because of some auto-correlation issues in the model.
. //In this case, the standard errors we calculated in the previous model by using ols method can hardly get the robust standard error of coefficients
. //Alternative approach: We can use robust ols method to get the adjusted standard errors of coefficients.We can also use gls to get robust standard errors of coefficients.
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/huangguo/Desktop/613/session 2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}16 Apr 2019, 02:29:24
{txt}{.-}
{smcl}
{txt}{sf}{ul off}